// Задача 1: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.
/*
Console.Write("Imput first number: ");
int n1 = Convert.ToInt32(Console.ReadLine()); //9
Console.Write("Imput second number: ");
int n2 = Convert.ToInt32(Console.ReadLine()); //3

if(n1 > n2)
{
    Console.WriteLine("Max number: " + n1 + " Min number: " + n2);
}
else
{
    Console.WriteLine("Max number: " + n2 + " Min number: " + n1);
}
*/
